# Pandas Overview
* package for data manipulation & analysis in Python
* derived from the econometrics term 'Panel Data'
* built on top of NumPy, making it very fast & efficient
* incorporates two additional data structures into Python which allow us to work with labeled and relational data in an easy and intuitive manner
 * Pandas Series (1D)
 * Pandas DataFrame (2D)
* comes installed with Anaconda
* documentation: https://pandas.pydata.org/pandas-docs/stable/
* notebook material created with Pandas version 0.22

In [3]:
# check version of Pandas
!conda list pandas

# packages in environment at /home/sarah/anaconda3:
#
# Name                    Version                   Build  Channel
pandas                    1.0.1            py37h0573a6f_0

Import Pandas & NumPy to use functionality in this Notebook (numpy first customarily)

In [4]:
import numpy as np
import pandas as pd

### Advantages of Pandas
Large datasets often donâ€™t come ready to be fed into your learning algorithms due to missing values, outliers, incorrect values, etc. Therefore, one very important step in machine learning is to look at your data first and make sure it is well suited for your training algorithm by doing some basic data analysis. Pandas Series and DataFrames are designed for fast data analysis and manipulation, as well as being flexible and easy to use.

**Features for Data Analysis**<br>
* Allows the use of labels for rows and columns
* Can calculate rolling statistics on time series data
* Easy handling of NaN values
* Is able to load data of different formats into DataFrames
* Can join and merge different datasets together
* It integrates with NumPy and Matplotlib

### Tidy Data
* standard of data cleaning which involves structuring datasets to facilitate analysis & helps translate data between tools
* tabular dataset where:
 * each variable is a column
 * each observation is a row
 * each type of observational unit is a table
* but sometimes need to summarize it in a non-tidy form in order to generate appropriate visualizations
* TD with Pandas Cheatsheet: https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf

***
**Data Wrangling**<br>
reshaping your data or perform transformations to split or combine features in your data, resulting in new data columns

# Pandas Series
* a one-dimensional array-like object that can hold many data types, such as numbers or strings, and has an option to provide axis labels.
* mutable

### Difference between NumPy ndarrays & Pandas Series
* can assign an index label to each element in the Pandas Series. 
* can hold data of different data types.

## Creating Series & Getting Metadata

**Create Pandas Series** <br>
pd.Series(data, index), where index is a list of index labels

In [5]:
groceries = pd.Series(data = [30, 6, 'Yes', 'No'], index = ['eggs', 'apples', 'milk', 'bread'])

groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

**Get info for Series**

In [6]:
print('Groceries has shape:', groceries.shape)
print('Groceries has dimension:', groceries.ndim)
print('Groceries has a total of', groceries.size, 'elements')
print('The data in Groceries is:', groceries.values)
print('The index of Groceries is:', groceries.index)

Groceries has shape: (4,)
Groceries has dimension: 1
Groceries has a total of 4 elements
The data in Groceries is: [30 6 'Yes' 'No']
The index of Groceries is: Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

**Check if index exists** <br>
Use the 'in' command

In [7]:
print('Is bread an index label in Groceries:', 'bread' in groceries)

Is bread an index label in Groceries: True

## Accessing Series
* Can access with label or index using indexing/boolean indexing
* Can access with label or index with attributes to remove ambiguity
 * .loc stands for location & used for labels
 * .iloc stands for integer location for indices
* Can also access single or multiple elements, but when accessing mulitple, the labels are given as well

In [8]:
# We use a single index label
print('How many eggs do we need to buy:', groceries['eggs'])
print()

# we can access multiple index labels
print('Do we need milk and bread:\n', groceries[['milk', 'bread']]) 
print()

# we use loc to access multiple index labels
print('How many eggs and apples do we need to buy:\n', groceries.loc[['eggs', 'apples']]) 
print()

# We access elements in Groceries using numerical indices:

# we use multiple numerical indices
print('How many eggs and apples do we need to buy:\n',  groceries[[0, 1]]) 
print()

# We use a negative numerical index
print('Do we need bread:\n', groceries[[-1]]) 
print()

# We use a single numerical index
print('How many eggs do we need to buy:', groceries[0]) 
print()
# we use iloc to access multiple numerical indices
print('Do we need milk and bread:\n', groceries.iloc[[2, 3]])

How many eggs do we need to buy: 30

Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object

How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object

Do we need bread:
 bread    No
dtype: object

How many eggs do we need to buy: 30

Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

## Modifying Series
* mutable
* modify using indexing
* delete using drop()
 * in-place or out-of-place depending on param
 * out-of-place by default so original doesn't change unless specified

**Updating Element**

In [9]:
# We change the number of eggs to 2
groceries['eggs'] = 2

# We display the changed grocery list
print('Modified Grocery List:\n', groceries)

Modified Grocery List:
 eggs        2
apples      6
milk      Yes
bread      No
dtype: object

**Deleting Element Out-of-Place**

In [11]:
print('We remove apples (out of place):\n', groceries.drop('apples'))
print()
print('Original not changed:\n', groceries)

We remove apples (out of place):
 eggs       2
milk     Yes
bread     No
dtype: object

Original not changed:
 eggs        2
apples      6
milk      Yes
bread      No
dtype: object

**Deleting Element In-Place** <br>
Use the 'inplace' param set to True

In [12]:
groceries.drop('apples', inplace = True)

print('Original changed:\n', groceries)

Original changed:
 eggs       2
milk     Yes
bread     No
dtype: object

**Deleting level**

### Arithmetic Operations on Series
when you have mixed data types in your Pandas Series make sure the arithmetic operations are valid on all the data types of your elements.
* I.E. strings can be multiplied but will get an error if you try to divide

**Arithmetic on all elements**

In [14]:
# create a Pandas Series that stores a grocery list of just fruits
fruits= pd.Series(data = [10, 6, 3,], index = ['apples', 'oranges', 'bananas'])
print('Original grocery list of fruits:\n ', fruits)

# We perform basic element-wise operations using arithmetic symbols
print('fruits + 2:\n', fruits + 2) # We add 2 to each item in fruits
print('fruits - 2:\n', fruits - 2) # We subtract 2 to each item in fruits
print('fruits * 2:\n', fruits * 2) # We multiply each item in fruits by 2 
print('fruits / 2:\n', fruits / 2) # We divide each item in fruits by 2

Original grocery list of fruits:
  apples     10
oranges     6
bananas     3
dtype: int64
fruits + 2:
 apples     12
oranges     8
bananas     5
dtype: int64
fruits - 2:
 apples     8
oranges    4
bananas    1
dtype: int64
fruits * 2:
 apples     20
oranges    12
bananas     6
dtype: int64
fruits / 2:
 apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

**Arithmetic on selected elements**

In [18]:
# We add 2 only to the bananas
print('Amount of bananas + 2 = ', fruits['bananas'] + 2)

# We subtract 2 from apples
print('Amount of apples - 2 = ', fruits.iloc[0] - 2)
print()

# We multiply apples and oranges by 2
print('We double the amount of apples and oranges:\n', fruits[['apples', 'oranges']] * 2)
print()

# We divide apples and oranges by 2
print('We half the amount of apples and oranges:\n', fruits.loc[['apples', 'oranges']] / 2)

Amount of bananas + 2 =  5
Amount of apples - 2 =  8

We double the amount of apples and oranges:
 apples     20
oranges    12
dtype: int64

We half the amount of apples and oranges:
 apples     5.0
oranges    3.0
dtype: float64

**Arithmetic Ops on Mixed Datatypes**

In [20]:
# groceries has a mix of strings & integers, but strings can by multiplied
groceries * 2

eggs          4
milk     YesYes
bread      NoNo
dtype: object

In [24]:
# groceries also has strings which cannot be divided & will throw an error
try:
    groceries / 2
except:
    print("TypeError will be raised!")

TypeError will be raised!

### Mathematical Operations from Numpy on Series

In [15]:
import numpy as np

In [16]:
print('EXP(X) = \n', np.exp(fruits))
print() 
print('SQRT(X) =\n', np.sqrt(fruits))
print()
print('POW(X,2) =\n',np.power(fruits,2))

EXP(X) =
 apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

SQRT(X) =
 apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

POW(X,2) =
 apples     100
oranges     36
bananas      9
dtype: int64

# Pandas DataFrames
* two-dimensional data structures with labeled rows and columns, that can hold many data types.
* can think of it as a really powerful spreadsheet
* one of the most commonly used Pandas object for data analysis in Python

## Creating DataFrames & Getting Metadata
* can create manually or by loading from a file
* displayed in tabular form, much like an Excel spreadsheet, with the labels of rows and columns in bold, unless using the print statement
* NaN values may appear in the DataFrame. NaN stands for Not a Number, and is Pandas way of indicating that it doesn't have a value for that particular row and column index
  * If we were to feed this data into a machine learning algorithm we will have to remove these NaN values first.

***
**Loading Data into DataFrame**
1. Created by using various methods specific to the file format.
 1. One of the most popular data formats used to store databases is CSV (Comma Separated Values)
2. Pandas uses numerical row indices on creation
3. File headers become column labels

**Manual DataFrame creation**
1. Created by converting a dict of Pandas Series, list of dicts, or dict of lists (last requires matching shape)
 1. Can select which data to be included
2. If created with Series, row labels of the DataFrame are built from the union of the index labels of the two Pandas Series we used to construct the dictionary. And the column labels of the DataFrame are taken from the keys of the dictionary.
3. columns are arranged alphabetically and not in the order given in the dictionary. We will see later that this won't happen when we load data into a DataFrame from a data file.
4. If we don't provide index labels to the Pandas Series, Pandas will use numerical row indexes when it creates the DataFrame

### Loading Data in DataFrame

**Load Data from CSV File**

In [5]:
# We load Google stock data in a DataFrame
google_stock = pd.read_csv('./resources/goog-1.csv')

# We print some information about Google_stock
print('Google_stock is of type:', type(google_stock))
print('Google_stock has shape:', google_stock.shape)

Google_stock is of type: <class 'pandas.core.frame.DataFrame'>
Google_stock has shape: (3313, 7)

### Manual DataFrame Creation

**Create DataFrame with Series - Specified Indices** <br>
First create dictionary of Pandas Series, then convert to DataFrame

In [27]:
# We create a dictionary of Pandas Series 
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

# We print the type of items to see that it is a dictionary
print("Data type to be converted:", type(items))

# We create a Pandas DataFrame by passing it a dictionary of Pandas Series
shopping_carts = pd.DataFrame(items)

# We display the DataFrame
shopping_carts

Data type to be converted: <class 'dict'>

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

**Create DataFrame with Series - Unspecified Indices** <br>
DataFrame assigns numerical row indices by default

In [28]:
# We create a dictionary of Pandas Series without indexes
data = {'Bob' : pd.Series([245, 25, 55]),
        'Alice' : pd.Series([40, 110, 500, 45])}

# We create a DataFrame
df = pd.DataFrame(data)

# We display the DataFrame
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

**Create DataFrame Subsets with Series** <br>
Select which data to put into DataFrame by means of the keywords columns and index.<br>
Note that print statement cancels formatting

In [35]:
# We Create a DataFrame that only has Bob's data
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])

# We display bob_shopping_cart
print("Bob only:\n", bob_shopping_cart)

# DataFrame that only has selected items for Alice
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])

# We display alice_sel_shopping_cart
alice_sel_shopping_cart

Bob only:
        Bob
bike   245
pants   25
watch   55

         Alice
glasses    110
bike       500

**Convert Series to DataFrame** <br>
Use Series.reset_index() to convert a series into a dataframe object

In [31]:
srs = pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch'])
print(srs)

df1 = srs.reset_index(name='count')
df1

bike     245
pants     25
watch     55
dtype: int64

   index  count
0   bike    245
1  pants     25
2  watch     55

**Create DataFrame with Lists** <br>
* all the lists (arrays) in the dictionary must be of the same length
* can inject labels on creation

In [37]:
# We create a dictionary of lists (arrays)
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

# We create a DataFrame 
print("Default labeled:\n", pd.DataFrame(data))

# We create a DataFrame and provide the row index
df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])

# We display the DataFrame
df

Default labeled:
    Integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

**Create DataFrame with Dictionaries** <br>
Note that, like with lists, custom labels were injected

In [24]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])

# We display the DataFrame
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

## Metadata & Stat Info

**Get metadata for DF**

In [30]:
# print some information about shopping_carts
print('shopping_carts has shape:', shopping_carts.shape)
print('shopping_carts has dimension:', shopping_carts.ndim)
print('shopping_carts has a total of:', shopping_carts.size, 'elements')
print()
print('data in shopping_carts:\n', shopping_carts.values)
print()
print('row index in shopping_carts:', shopping_carts.index)
print('column index in shopping_carts:', shopping_carts.columns)

shopping_carts has shape: (5, 2)
shopping_carts has dimension: 2
shopping_carts has a total of: 10 elements

data in shopping_carts:
 [[245. 500.]
 [ nan  40.]
 [ nan 110.]
 [ 25.  45.]
 [ 55.  nan]]

row index in shopping_carts: Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')
column index in shopping_carts: Index(['Bob', 'Alice'], dtype='object')

**Get descriptive statistics summary on entire DF**

In [115]:
google_stock.describe()

         Open    High     Low   Close  Adj Close   Volume
count  3313.0  3313.0  3313.0  3313.0     3313.0  3.3e+03
mean    380.2   383.5   376.5   380.1      380.1  8.0e+06
std     223.8   225.0   222.5   223.9      223.9  8.4e+06
min      49.3    50.5    47.7    49.7       49.7  7.9e+03
25%     226.6   228.4   224.0   226.4      226.4  2.6e+06
50%     293.3   295.4   289.9   293.0      293.0  5.3e+06
75%     536.7   540.0   532.4   536.7      536.7  1.1e+07
max     992.0   997.2   989.0   989.7      989.7  8.3e+07

**Get descriptive statistics on single column**

In [116]:
google_stock['Adj Close'].describe()

count    3313.0
mean      380.1
std       223.9
min        49.7
25%       226.4
50%       293.0
75%       536.7
max       989.7
Name: Adj Close, dtype: float64

**Get single stats across columns**

In [118]:
print('Maximum values of each column:\n', Google_stock.max())
print()
print('Minimum Close value:', Google_stock['Close'].min())
print()
print('Average value of each column:\n', Google_stock.mean())

Maximum values of each column:
 Date         2017-10-13
Open              1e+03
High              1e+03
Low               1e+03
Close             1e+03
Adj Close         1e+03
Volume         82768100
dtype: object

Minimum Close value: 49.681866

Average value of each column:
 Open         3.8e+02
High         3.8e+02
Low          3.8e+02
Close        3.8e+02
Adj Close    3.8e+02
Volume       8.0e+06
dtype: float64

**Get correlation statistics** <br>
A correlation value of 1 tells us there is a high correlation and a correlation of 0 tells us that the data is not correlated at all

In [119]:
google_stock.corr()

           Open  High  Low  Close  Adj Close  Volume
Open        1.0   1.0  1.0    1.0        1.0    -0.6
High        1.0   1.0  1.0    1.0        1.0    -0.6
Low         1.0   1.0  1.0    1.0        1.0    -0.6
Close       1.0   1.0  1.0    1.0        1.0    -0.6
Adj Close   1.0   1.0  1.0    1.0        1.0    -0.6
Volume     -0.6  -0.6 -0.6   -0.6       -0.6     1.0

## Accessing DataFrames

**View first or last n rows** <br>
* Helpful for large datasets
* Default is 5 for no provided param

In [113]:
google_stock.head(3)
# google_stock.tail()

         Date  Open  High   Low  Close  Adj Close    Volume
0  2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500
1  2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800
2  2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200

**Accessing columns, rows, elements** <br>
when accessing individual elements in a DataFrame, labels should always be provided with the column label first <br> i.e. in the form dataframe[column][row]

In [26]:
# We print the store_items DataFrame
print(store_items)

# We access rows, columns and elements using labels
print()
print('How many bikes are in each store:\n', store_items[['bikes']])
print()
print('How many bikes and pants are in each store:\n', store_items[['bikes', 'pants']])
print()
print('What items are in Store 1:\n', store_items.loc[['store 1']])
print()
print('How many bikes are in Store 2:', store_items['bikes']['store 2'])

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

How many bikes are in each store:
          bikes
store 1     20
store 2     15

How many bikes and pants are in each store:
          bikes  pants
store 1     20     30
store 2     15      5

What items are in Store 1:
          bikes  pants  watches  glasses
store 1     20     30       35      NaN

How many bikes are in Store 2: 15

## Modifying DataFrames

**Add columns to the end**

In [50]:
# We print the store_items DataFrame
print(store_items)

# We add a new column named shirts to our store_items DataFrame indicating the number of
# shirts in stock at each store. We will put 15 shirts in store 1 and 2 shirts in store 2
store_items['shirts'] = [15,2]

# Can also add columns using arithmetic operations between existin columns
# We make a new column called suits by adding the number of shirts and pants
store_items['suits'] = store_items['pants'] + store_items['shirts']

# add new column of inventory using indexing to fill all columns
store_items['new glasses'] = store_items['watches'][1]

# add new column of inventory slicing to fill only certain columns
store_items['new watches'] = store_items['watches'][1:2]


# We display the modified DataFrame
store_items

         bikes  pants  watches  glasses  shirts  suits  new watches
store 1     20     30       35      NaN      15     45          NaN
store 2     15      5       10     50.0       2      7         10.0

,bikes,pants,watches,glasses,shirts,suits,new watches,new glasses
store 1,20,30,35,NaN,15,45,NaN,10
store 2,15,5,10,50.0,2,7,10.0,10

**Add rows (default alphabetical)** <br>
Must first create a new Dataframe and then append it to the original DataFrame. <br>
New rows added in alphabetical order.

In [51]:
# We create a dictionary from a list of Python dictionaries that will contain the number of different items at the new store
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# We create new DataFrame with the new_items and provide and index labeled store 3
new_store = pd.DataFrame(new_items, index = ['store 3'])

# We append store 3 to our store_items DataFrame
store_items = store_items.append(new_store)

# We display the modified DataFrame
store_items

,bikes,pants,watches,glasses,shirts,suits,new watches,new glasses
store 1,20,30,35,NaN,15.0,45.0,NaN,10.0
store 2,15,5,10,50.0,2.0,7.0,10.0,10.0
store 3,20,30,35,4.0,NaN,NaN,NaN,NaN

**Insert columns anywhere** <br>
dataframe.insert(loc,label,data) method allows us to insert a new column in the dataframe at location loc, with the given column label, and given data

In [52]:
# We insert a new column with label shoes right before the column with numerical index 4
store_items.insert(4, 'shoes', [8,5,0])

# we display the modified DataFrame
store_items

,bikes,pants,watches,glasses,shoes,shirts,suits,new watches,new glasses
store 1,20,30,35,NaN,8,15.0,45.0,NaN,10.0
store 2,15,5,10,50.0,5,2.0,7.0,10.0,10.0
store 3,20,30,35,4.0,0,NaN,NaN,NaN,NaN

**Delete single columns** <br>
pop() method only works for columns

In [54]:
# We remove the new watches column
store_items.pop('new watches')

# we display the modified DataFrame
store_items

         bikes  pants  watches  glasses  shoes  shirts  suits  new glasses
store 1     20     30       35      NaN      8    15.0   45.0         10.0
store 2     15      5       10     50.0      5     2.0    7.0         10.0
store 3     20     30       35      4.0      0     NaN    NaN          NaN

**Delete multiple columns or rows** <br>
Uses drop() method that works for both columns & rows, depending on the axis param

In [55]:
# We remove the watches and shoes columns
store_items = store_items.drop(['watches', 'shoes'], axis = 1)

# We remove the store 2 and store 1 rows
store_items = store_items.drop(['store 2', 'store 1'], axis = 0)

# we display the modified DataFrame
store_items

         bikes  pants  glasses  shirts  suits  new glasses
store 3     20     30      4.0     NaN    NaN          NaN

**Rename a column or row labels** <br>
dict is passed into the rename method where the key is the original label & value is the new one

In [56]:
# We change the column label bikes to hats
store_items = store_items.rename(columns = {'bikes': 'hats'})

# We change the row label from store 3 to last store
store_items = store_items.rename(index = {'store 3': 'last store'})

# we display the modified DataFrame
store_items

            hats  pants  glasses  shirts  suits  new glasses
last store    20     30      4.0     NaN    NaN          NaN

**Set index using existing columns** <br>
Can also be used to set multiple indices

In [57]:
# We change the row index to be the data in the pants column
store_items = store_items.set_index('pants')

# we display the modified DataFrame
store_items

       hats  glasses  shirts  suits  new glasses
pants
30       20      4.0     NaN    NaN          NaN

# Data Wrangling
Data wrangling is the process of cleaning and unifying messy and complex data sets for easy access and analysis. Used to keep in standard with Tidy Data principles as well as for cleaning & merging for analysis.
1. Grouping Data
2. Dealing with NAN Values
4. Reshaping Columns & Rows

## 1. Grouping Data
* groupby() method returns a SeriesGroupBy object whose methods return a Pandas Series object.
 * .sum() will sum the counts
 * .size() will give frequency
 * .mean() gives the means
* will need to be converted back into a DataFrame if desired (see DF Creation section)

In [23]:
# get new data to work with
data = pd.read_csv('./resources/fake-company.csv')
data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

**Group data on single column**

In [28]:
# We display the total amount of money spent in salaries each year
tot_sal_p_yr = data.groupby(['Year'])['Salary'].sum()
print("Total salaries p year:\n", tot_sal_p_yr)
print()
# We display the average salary per year
av_sal_p_yr = data.groupby(['Year'])['Salary'].mean()
print("Average salaries p year:\n", av_sal_p_yr)

Total salaries p year:
 Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

Average salaries p year:
 Year
1990    51000
1991    54000
1992    58000
Name: Salary, dtype: int64

**Group data on multiple columns**

In [31]:
# We display the salary distribution per department per year.
data.groupby(['Year', 'Department'])['Salary'].sum()

Year  Department
1990  Admin          55000
      HR             50000
      RD             48000
1991  Admin          60000
      HR             52000
      RD             50000
1992  Admin         122000
      RD             52000
Name: Salary, dtype: int64

## 2. Dealing with NAN Values
Will need to clean data before injecting into algorithms using a method for detecting and correcting errors in our data. <br>
While any given dataset can have many types of bad data, such as outliers or incorrect values, the type of bad data we encounter almost always is missing values, which Pandas assigns as NaN values.

***
1. Can detect either by:
 1. Summing null values
 2. Counting non-NAN values

2. Can correct by:
 1. Drop
 2. Replace

Start by creating DataFrame with NAN values in it.

In [76]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

# We display the DataFrame
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [32]:
# to create null values
# not used, just ex
np.nan

nan

**Check for Null Values**

In [12]:
google_stock.isnull()
# .isna() is same

       Date   Open   High    Low  Close  Adj Close  Volume
0     False  False  False  False  False      False   False
1     False  False  False  False  False      False   False
2     False  False  False  False  False      False   False
3     False  False  False  False  False      False   False
4     False  False  False  False  False      False   False
...     ...    ...    ...    ...    ...        ...     ...
3308  False  False  False  False  False      False   False
3309  False  False  False  False  False      False   False
3310  False  False  False  False  False      False   False
3311  False  False  False  False  False      False   False
3312  False  False  False  False  False      False   False

[3313 rows x 7 columns]

In [13]:
google_stock.isna().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

**Summing Null Values to Detect NAN Data** <br>
Combine the .isnull() with .sum() twice to find all NAN values
* the .isnull() method returns a Boolean DataFrame of the same size as store_items and indicates with True the elements that have NaN values and with False the elements that are not.
 * In Pandas, logical True values have numerical value 1 and logical False values have numerical value 0.
* the first sum returns a Pandas Series with the sums of logical True values along columns
* the second sum will then add up the 1s in the above Pandas Series

In [60]:
store_items.isnull()

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1  False  False    False   False  False  False     True
store 2  False  False    False   False  False  False    False
store 3  False  False    False    True  False   True    False

In [61]:
store_items.isnull().sum()

bikes      0
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64

In [62]:
# Put all methods together to get count of NAN values...
x =  store_items.isnull().sum().sum()

# We print x
print('Number of NaN values in our DataFrame:', x)

Number of NaN values in our DataFrame: 3

**Counting non-NAN Values to Detect NAN Data** <br>
Combine .count() method with .sum()

In [66]:
store_items.count()

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

In [67]:
print('Number of non-NaN values in our DataFrame:', store_items.count().sum())

Number of non-NaN values in our DataFrame: 18

**Deleting rows/columns with NAN values**
* the .dropna() does not affect the original DF by default. The param inplace=True needs to be set
* axis determines rows (0) vs columns (1)

In [68]:
# We drop any rows with NaN values
store_items.dropna(axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [73]:
# We drop any columns with NaN values
store_items.dropna(axis = 1)

# in-place deletion (changes persist on original structure)
# store_items.dropna(axis = 1, inplace=True)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

**Replace NAN values with custom column values** <br>
value param takes a dict where keys are column labels & values are constants for entire column

In [97]:
col_vals = {'shirts': 666, 'glasses': 777}
store_items.fillna(col_vals)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0    777.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35   666.0     10    NaN      4.0

**Replace NAN values with 0**

In [74]:
# We replace all NaN values with 0
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

**Replace NAN values by forward filling or backward filling** <br>
* uses previous or subsequent values taken from either columns or rows, in-place or out-of-place
 * method param: ffill=previous valuse, backfill=subsequent
 * axis param: 0=rows, 1=columns
 * inplace param: True=changes orginal, absent param is default out-of-place
* HOWEVER if a column or row is at the edge of the DF, it has no previous or subsequent values & the element remains NAN

In [77]:
# replace NaN values with the previous value in the column
# Note that last column in row 1 remains NAN
store_items.fillna(method = 'ffill', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [79]:
# We replace NaN values with the next value in the row
store_items.fillna(method = 'backfill', axis = 1)

# to change original, use inplace=True
#store_items.fillna(method = 'backfill', axis = 1, inplace=True)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0      NaN
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    10.0   10.0    4.0      4.0

**Replace NAN values using interpolation** <br>
* Uses surrounding values to estimate NAN value
* doesn't work for NAN vals at the edge of the DF depeding on axis specified

In [80]:
# We replace NaN values by using linear interpolation using column values
store_items.interpolate(method = 'linear', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [81]:
# We replace NaN values by using linear interpolation using row values
store_items.interpolate(method = 'linear', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    22.5   10.0    7.0      4.0

### Exercise: Book Ratings with NAN Values

**setup DataFrame**

In [82]:
# Set the precision of our dataframes to one decimal place.
pd.set_option('precision', 1)

# gather book/author data
books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])
# gather user ratings data
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

# convert to dictionary
dat = {'Author': authors, 'Book Title': books, 'User 1': user_1, 'User 2': user_2, 'User 3': user_3, 'User 4': user_4}

# convert to DataFrame
book_ratings = pd.DataFrame(dat)

book_ratings

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     NaN     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     NaN     4.0
3          H. G. Wells     The Time Machine     NaN     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     NaN     NaN     NaN     4.2

**Fill in NAN values with average rating for that user column**

In [96]:
user_averages = {'User 1': 0, 'User 2': 0, 'User 3': 0, 'User 4': 0}

for key, val in user_averages.items():
    user_averages[key] = book_ratings[[key]].mean()[key]

book_ratings.fillna(value=user_averages)

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     2.9     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     2.8     4.0
3          H. G. Wells     The Time Machine     2.9     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     2.9     3.5     2.8     4.2

**Get all 5 star books** <br>
code returns a NumPy ndarray that only contains the names of the books that had a rating of 5

In [106]:
book_ratings[(book_ratings == 5).any(axis = 1)]['Book Title'].values

array(['Great Expectations', 'The Time Machine'], dtype=object)

## 3. Reshaping Columns & Rows

In [32]:
# Read the data from a CSV file to work with
pokemon = pd.read_csv('./resources/pokemon.csv')
print(pokemon.shape)
pokemon.head(10)

(807, 14)

,id,species,generation_id,height,weight,base_experience,type_1,type_2,hp,attack,defense,speed,special-attack,special-defense
0,1,bulbasaur,1,0.7,6.9,64,grass,poison,45,49,49,45,65,65
1,2,ivysaur,1,1.0,13.0,142,grass,poison,60,62,63,60,80,80
2,3,venusaur,1,2.0,100.0,236,grass,poison,80,82,83,80,100,100
3,4,charmander,1,0.6,8.5,62,fire,NaN,39,52,43,65,60,50
4,5,charmeleon,1,1.1,19.0,142,fire,NaN,58,64,58,80,80,65
5,6,charizard,1,1.7,90.5,240,fire,flying,78,84,78,100,109,85
6,7,squirtle,1,0.5,9.0,63,water,NaN,44,48,65,43,50,64
7,8,wartortle,1,1.0,22.5,142,water,NaN,59,63,80,58,65,80
8,9,blastoise,1,1.6,85.5,239,water,NaN,79,83,100,78,85,105
9,10,caterpie,1,0.3,2.9,39,bug,NaN,45,30,35,45,20,20

**Melt two columns together/Pivot column to rows** <br>
DataFrame.melt(id_vars, value_vars, var_name, value_name, col_level, ignore_index)
* id_vars - It is a tuple representing the column(s) to use as identifier variables.
* value_vars - It is tuple representing the column(s) to unpivot (remove, out of place).
* var_name - It is a name of the new column.
* value_name - It is a name to use for the â€˜valueâ€™ of the columns that are unpivoted.

***
The function below will do the following in the pokemon dataframe out of place:

1. Select the 'id', and 'species' columns from pokemon.
2. Remove the 'type_1', 'type_2' columns from pokemon
3. Add a new column 'type_level' that can have a value either 'type_1' or 'type_2'
4. Add another column 'type' that will contain the actual value contained in the 'type_1', 'type_2' columns. For example, the first row in the pokemon dataframe having id=1 and species=bulbasaur will now occur twice in the resulting dataframe after the melt() operation. The first occurrence will have type=grass, whereas, the second occurrence will have type=poison.

In [34]:
pkmn_types = pokemon.melt(id_vars=['id', 'species'], 
                          value_vars=['type_1', 'type_2'], 
                          var_name='type_level', 
                          value_name='type')
pkmn_types.head(10)
#pkmn_types.shape

   id     species type_level   type
0   1   bulbasaur     type_1  grass
1   2     ivysaur     type_1  grass
2   3    venusaur     type_1  grass
3   4  charmander     type_1   fire
4   5  charmeleon     type_1   fire
5   6   charizard     type_1   fire
6   7    squirtle     type_1  water
7   8   wartortle     type_1  water
8   9   blastoise     type_1  water
9  10    caterpie     type_1    bug

**Pivot rows to columns**

In [38]:
pkmn_types.pivot(index='species', columns='type_level', values='type')

type_level   type_1  type_2
species
abomasnow     grass     ice
abra        psychic     NaN
absol          dark     NaN
accelgor        bug     NaN
aegislash     steel   ghost
...             ...     ...
zoroark        dark     NaN
zorua          dark     NaN
zubat        poison  flying
zweilous       dark  dragon
zygarde      dragon  ground

[807 rows x 2 columns]